#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает соответствие остатков товаров на складах для указанной номенклатуры.
//
// Параметры:
//   Номенклатура - СправочникСсылка.Номенклатура - номенклатура для получения остатков
//   Склады - Массив из СправочникСсылка.Склады - список складов для проверки остатков
//
// Возвращаемое значение:
//   Соответствие:
//     * Ключ - СправочникСсылка.Склады - склад
//     * Значение - Число - количество товара на складе
Функция ОстатокПоНоменклатуре(Номенклатура, Склады) Экспорт

	ОстатокПоСкладам = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыНаСкладе.Склад КАК Склад,
	|	ТоварыНаСкладе.Количество КАК Количество
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладе.Остатки(, 
	|		Номенклатура = &Номенклатура
	|		И Склад В (&Склады)) КАК ТоварыНаСкладе";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склады", Склады);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		ОстатокПоСкладам.Вставить(Выборка.Склад, Выборка.Количество);
	КонецЦикла;

	
	Возврат ОстатокПоСкладам;

КонецФункции

// Функция возвращает остатки всей номенклатуры на переданном складе
//
// Параметры:
//  Склад - Строка - склад, остатки на котором необходимо получить
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с колонками: Артикул, ЕдиницаИзмерения, КоличествоОстаток, СуммаОстаток
//
Функция ОстаткиНаСкладе(Склад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Артикул КАК Артикул,
		|	ЕдиницыИзмерения.Наименование КАК ЕдиницаИзмерения,
		|	ТоварыНаСкладе.Количество КАК КоличествоОстаток,
		|	ТоварыНаСкладе.Сумма КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладе.Остатки(, 
		|		Склад = &Склад) КАК ТоварыНаСкладе
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ТоварыНаСкладе.Номенклатура = Номенклатура.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|		ПО Номенклатура.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка";
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗначений = Результат.Выгрузить();
	
	Возврат ТаблицаЗначений;
	
КонецФункции

#КонецОбласти

#КонецЕсли
