#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ТоварыНаСкладе.Записывать = Истина;
	
	Для Каждого СтрокаТовары Из Товары Цикл
		Движение = Движения.ТоварыНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = СтрокаТовары.Номенклатура;
		Движение.Склад = "Основной";
		Движение.Количество = СтрокаТовары.Количество;
		Движение.Сумма = СтрокаТовары.Сумма;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти