#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстПользователю = "Ввели количество";

	РассчитатьСуммуСтроки(ТекущиеДанные, ТекстПользователю);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстПользователю = "Поменялась цена";

	РассчитатьСуммуСтроки(ТекущиеДанные, ТекстПользователю);

КонецПроцедуры



&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Номенклатура = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьИПоказатьОстаткиПоНоменклатуре(ТекущиеДанные.Номенклатура);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(Строка, Сообщение)

	Строка.Сумма = Строка.Цена * Строка.Количество;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Сообщение;
	Сообщение.Сообщить();
	Человек = ОписаниеСотрудника();
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Человек.Имя;
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Функция ОписаниеСотрудника()

	Сотрудник = Новый Структура;
	Сотрудник.Вставить("Имя", "Антон");
	Сотрудник.Вставить("ДатаРождения", ТекущаяДата());
	Сотрудник.Вставить("СтажЛет", 15);
	Сотрудник.Вставить("Штатный", Ложь);

	Возврат Сотрудник;

КонецФункции

&НаКлиенте
Процедура ПолучитьИПоказатьОстаткиПоНоменклатуре(Номенклатура)
	Остатки = ПолучитьОстаткиПоНоменклатуреНаСервере(Номенклатура);
	
	Если Остатки.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет остатков по данной номенклатуре";
		Сообщение.Сообщить();
	Иначе
		Для Каждого Остаток Из Остатки Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Склад: %1, Остаток: %2", Остаток.Ключ, Остаток.Значение);
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОстаткиПоНоменклатуреНаСервере(Знач Номенклатура)
	Склады = ПолучитьСписокСкладов();
	Возврат РегистрыНакопления.ТоварыНаСкладе.ОстатокПоНоменклатуре(Номенклатура, Склады);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокСкладов()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РАЗЛИЧНЫЕ ТоварыНаСкладе.Склад КАК Склад
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладе КАК ТоварыНаСкладе";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Склады = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Склады.Добавить(Выборка.Склад);
	КонецЦикла;
	
	Возврат Склады;
КонецФункции


#КонецОбласти